'number' + 3 + 3//Результат буде "number33" тому що працює контактинація,спочатку 'number' + 3 = "number3" (рядок) і + 3 буде "number33"

null + 3//Результат буде 3 тому що null це 0 а 0 + 3 буде 3

5 && "qwerty"//оператор && повертає останнє істинне значення,а так як 5 буде тру і qwerty буде тру то повертаєтсья qwerty отже відповідь qwerty

+'40' + +'2' + "hillel";//оператор + коли знаходить перед рядками то перетворює їх у числа,і так виходить 40+2=42 і додається рядок "hillel", конкатеція і виходить "42hillel"

'10' - 5 === 6;//оператор - перетворює рядок '10' у число 10 і виконує операцію 10-5 що дає 5,потім виконується строге порівняння 5===6,з цього робиться висновок що 5 не дорівнює 6 і відповідь буде фалс

true + false//тру це 1 а фалс це 0 1+0 буде 1

'4px' - 3//воно спробує перетворити '4px' в число,а так як там є букви то не зможе і буде нан тому що один з операторів не являється числом

'4' - 3//перетворює рядок на число і 1

'6' + 3 ** 0;// **підносить до степеня 3 в степені 0 буде 1,далі конкатенація рядок 6 + число 1 ліпить в кучк і буде рядок 61

12 / '6'//рядок 6 перетворюється в число 12 ділиться на 6 буде 2

'10' + (5 === 6);//5 не дорівнює 6 отже буде фалс,далі конкатенація ліпить в кучу 10фалс

null == ''//нул не рівняється до порожнього рядка(нул можна порівнять тільки з андефаенд) результат фалс

3 ** (9 / 3);//9 ділиться на 3 і буде 3,а 3 в степені 3 буде 27,результат 27

!!'false' == !!'true'//!! перетворює значення в булевий тип,а так як обидва рядка при перетворені стануть тру то відповідь буде тру

0 || '0' && 1//спочатку повертає останнє значення тру це буде 1 потім повертається перше тру і буде 1 так як 0 буде фалс

(+null == false) < 1;//+ перед нал перетворює нал в число,а нал в числі буде 0 потім порівнюється 0 з фалс,а фалс також дає 0 тому при порівнянні буде тру,тру це 1 а 1 не менше 1 тому результат фалс

false && true || true//повертається перше хибне значення і буде фалс,потім повертає перше тру а в нас це тру тому відповідь тру

false && (false || true);//повертає перше тру в дужках це буде тру,потім повертає перший хибний порівнюється фалс з тру результат фалс

(+null == false) < 1 ** 5;//перетворює нал на число 0,потім порівнюється 0 з фалс а фалс це 0 тому буде тру,потім 1 в степені 5 буде 1,потім тру не менше 1 тому що тру це 1 а 1 не менше 1 результат фалс